# StairGetConstType

## Description
Returns construction type of stair.

```pascal
FUNCTION StairGetConstType(stair : HANDLE) : INTEGER;
```

```python

def vs.StairGetConstType(stair):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE||

## Version
Availability: from Vectorworks 2021
## Category
* Objects - Stairs